Autodesk.Revit.DB.ViewDisplaySketchyLines.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewDisplaySketchyLines.Extension
The extension scale value. Controls the magnitude of line's extension.
Values between 0 and 10.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The extension value is not valid. The valid range is 0 to 10.
Since:
2015

Autodesk.Revit.DB.ViewDisplaySketchyLines.EnableSketchyLines
True to enable sketchy lines visibility. False to disable it.
Since:
2015

Autodesk.Revit.DB.ViewDisplaySketchyLines.Jitter
The jitter defines jitteriness of the line.
Values between 0 and 10.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The jitter value is not valid. The valid range is 0 to 10.
Since:
2015

Autodesk.Revit.DB.ViewDisplaySketchyLines
Represents the settings for sketchy lines.
Since:
2015